app/views/usuarios/index.html.erb

                  <%= f.label :tipo_recurso, 'Rol' %>
                  <%= f.select :tipo_recurso_id, TipoRecurso.find_all_by_unit(1).map{|p| [p.nombre, p.id]} %>
---
SELECT `tipo_recursos`.* FROM `tipo_recursos` WHERE `tipo_recursos`.`unit` = 1