app/controllers/recursos_controller.rb

  def index
    @recursos = Recurso.find_all_by_organizacion_id(Usuario.find_by_id(current_user.id).organizacion_id)
    @recursos.sort_by(&:created_at).reverse
    @tipo_recursos = TipoRecurso.all.uniq
    @organizacions = Organizacion.all.uniq
---
SELECT `tipo_recursos`.* FROM `tipo_recursos`
SELECT `organizacions`.* FROM `organizacions`